[
    {
        "ratings": {
            "5 star": "82%",
            "4 star": "8%",
            "3 star": "3%",
            "2 star": "2%",
            "1 star": "5%"
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "I was loving my instant pot, bragging to all about it. Making my dogs food was so easy! I put in the food and the water, pressed pressure cook and like magic it was just done when it beeped. Getting used to the pressurization wasn't hard at all. It wasn't really difficult to use. Until last week... My pot just didn't turn on! I tried other outlets and other electronics so it was not the outlet. I moved the pot to a different outlet, nothing. It was the pot. The manual gave explicit troubleshooting directions based on what is wrong. Not turning on meant that the circuit board blew and it advised to call support, which I did. When you call, an automated message tells you to go online and put in a ticket- because this is clearly a company that doesn't want to be bothered 'talking' to their customers. So I do this. A day later no response! So I email again asking for help. This time I email them the same information. Didn't hear from them until Friday! I needed my pot fixed on Tuesday.... On Thursday though I had had enough and called Amazon who thankfully knows how to treat customers and were able to refund me the product and I shipped it back to them. The pot was less than a year of purchase and within warranty after all! Even Amazon tried getting ahold of the company and they couldn't get a response! Beware of this brand! I would look for another pressure cooker because when it breaks, and it likely will, you won't be getting help for days.... My first attempt to post this review Amazon blocked for an unknown reason. It should be posted though people should know what kind of company this is...",
                "review_posted_date": "29 Aug 2018",
                "review_header": "Bad customer service!",
                "review_rating": "1.0 ",
                "review_author": "HomeForSummer"
            },
            {
                "review_comment_count": "",
                "review_text": "I use this for everything! How did I live without this before??? I live in a Sprinter van full-time and was using an induction burner for cooking, but since I've gotten this little gem, I haven't used the induction burner once! This is so easy to use, and it's the perfect size for one or two people. I've been making a lot of stews, and I'll saute the onions, carrots, and meat (if I'm using meat) then add everything else, seal it, and set it for 7 minutes on high pressure. I let it release naturally and have a perfectly cooked, tasty meal every time. This gives me enough for 4 or 5 servings. I also quick soaked beans the other day by covering them with water, hitting pressure for 5 min. then letting it release naturally and let it sit (not on keep warm) for a couple of hours. I'll often make dinner right after I reheat my lunch, and make sure the keep warm function is on. I'm able to drive with it in my sink and have a hot, healthy, delicious meal waiting for me when I'm done driving. I've even baked banana bread in it!!! So exciting, because I don't have an oven. It turned out SO good! I used one of the containers and the lid from my To-Go Ware stainless steel lunch container to bake it in on the rack. Because this cooks so quickly, it is very easy on my solar system. I can reheat leftovers on saute in 4 minutes, and it's only drawing 67a while it's on. I did have a VitaClay, that I absolutely loved for making beans, and especially bone broth, but it takes much longer to cook and is heavier. So, more battery drain, more storage space, and more weight as compared to the Instant Pot Mini and the Mini wins on each count!",
                "review_posted_date": "08 Oct 2017",
                "review_header": "Perfect Tiny Living appliance",
                "review_rating": "5.0 ",
                "review_author": "The Galavan"
            },
            {
                "review_comment_count": "",
                "review_text": "This pot is designed to not work. The surface area of the pressure indicating valve is too small for the weight of the valve to be lifted by steam pressure. Result? The valve stays open and the pot simply boils away the liquid inside and does not build pressure. The \"solution\" is to use an implement of some sort to manually pull the indicating valve up into a sealed position once the pot starts to make steam. If this is not done, the valve will not lift and seal and water will simply boil away. It is important to note that this is not due to a dirty valve, a sticky valve, insufficient liquid or any malfunction. Rather, it is designed into the pot. Ours will be relegated to stock pot duty as we have found it to be totally unusable as a pressure cooker.",
                "review_posted_date": "31 Dec 2017",
                "review_header": "MAJOR FAILURE",
                "review_rating": "1.0 ",
                "review_author": "BLS"
            },
            {
                "review_comment_count": "",
                "review_text": "Just worked a year! The light is on but no heat. I called the customer service and got the answer was if it is over a year warranty that I need buy a new pot base as almost the whole cooker's price. Very disappointed!",
                "review_posted_date": "26 Jan 2017",
                "review_header": "Very disappointed!",
                "review_rating": "1.0 ",
                "review_author": "Amazon Customer"
            }
        ],
        "url": "http://www.amazon.com/dp/B07RCNHTLS",
        "name": "Instant Pot DUO NOVA 6 Qt 7-in-1 Multi-Use Programmable Pressure Cooker, Slow Cooker, Rice Cooker, Steamer, Sauté, Yogurt Maker and Warmer",
        "price": "$99.99"
    }
]